Repository: mozilla-l10n/mt-training-data
Catalog: dml/dml_pontoon.tmx
Source language: en_us
Languages: dml

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
dml: عام کاڻ اچکھ ایس ابُت کُرئیں کی مدد کُرن گٹِنُمہ، لے ابُت ای میل تہ زریعہ یا بہ مُشکُل، فورم نم سائٹ تہ مسلہ نم تہ زریعہ جمع کُرا،GitHub، یا بہ شامل با، میٹریکس، برادری تہ چیٹ

source: Want to save your information? <createProfile>Create a profile</createProfile>
dml: تاں معلومات محفوط کُرن گٹینُمہ<createProfile>ایک فروفائل ژوپئی</createProfile>

source: Want to stay in touch with Common Voice?
dml: ائی عام کاݩہ ملی تھین گٹینُمہ

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
dml: کیر ائی کامن وائس تہ ڈیٹاسیٹ تہ نواں ورژن جاری کُرال بُمہ بہ تا ائی اپ ڈیٹ گٹینُمہ۔ امونہ خبر تہ خط سبسکرائب کُرا

source: Watch our video explainer to help
dml: امونہ پوئی کُرن تہ ویڈیو دڇھا مدم تہ پرئی

source: Wayuunaiki
dml: وایونائیکی

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
dml: ئی ہمیشہ ڈیٹا استعمل کُرال تہ تسونہ ضروریات آں سیاق و سباق تہ بارہ اُشتُرنن تہ کوشیش کُنُمہ، ڈیٹا جمع کُرن تہ پلیٹ فام تعاون کُرن تہ گی ڈیٹا تہ صحت تہ بصیرت پرین تلی ائی گٹنُمہ تے<emailFragment>میا تہ اُشتُرنیمہ</emailFragment>

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
dml: ائی کاڻ ساں ایک ہر کولو آں عوامی طور میل بال ڈیٹا سیٹ ژوپائیمہ تس ہر کُرئی تقریر تہ قابل ایپلی کیشن ساں ترتیب پریاں کی استعمل کُرین بَو

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
dml: ائی ٹکینالوجی، جدت آں باݜہ تہ حقوقہ عوم ساں شرکت تہ حمایت کُرنہ پرجوش تُھومہ۔ اگر ایک بلو پرجیکٹ چلن تہ سوچ کُنبہ ، تا مہربانی کُری <emailFragment>رابطہ کُرا</emailFragment>

source: We are going out to get a coffee.
dml: ائی کافی گیاں کی بران ینُمہ

source: We are going out to get coffee.
dml: ائی کافی گیاں کی بران ینُمہ

source: We are offering more options to give people more choice in what they tell us about their sex or gender identity. Please self-describe in the way that feels most natural to you. <learnMoreLink>Learn more about our approach to sex and gender.</learnMoreLink>
dml: ائی ماݜہ کی تسونہ جنسی یا صفاتی شناخت ساں بارہ ورے ایس انتخاب پریاں کی لے اختیارات پُرینُمہ۔مہربانی کُری تانوں زان یہ انداہ بیان کُرا تے کیرا قدرتی تِھیو۔<learnMoreLink>امونہ جنس آں صنف ساں حوالہ امونہ طریقی کار ساں بارہ ورے ایس زانا۔</learnMoreLink>

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
dml: ائی موزیلا کاڻ تہ ٹکینالونی تہ کمیونٹٰی ژوپائیمہ۔ ائی میا ملی رابطہ تھین گٹنُمہ تے میاکی تازہ ترین معلومات، نواں ڈیٹا زرائع تہ اگاہ کُریمہ، تے بی یہ ڈیٹا کنو کُری استعمل کُنبہ۔

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
dml: ائی یہ یقین کُنُمہ تے بلو آں عوامی طورہ میلوبال ڈیٹا سیٹ مشین لرننگہ مشتمل تقریری ٹیکنالوجی جدت آں صحت مند مقابلہ تجارتی مقابلہ پیاد کُریمہ۔ یہ ایک عالمی کوشیش درو آں سپُنہ کی شرکت تہ دعوت پرینُمہ۔ امونہ مقصد تقریری ٹیکنالوجی ورے ایس جامع کُرن درو۔ یہ تمام دنیا تہ کاڻ تہ تنو تہ عکاسی کُرو

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
dml: ائی یہ گٹینُمہ تے عوامی طور میلوبال کاڻ تہ ڈیٹا سیٹ مشین لرننگ ݜا مبی تقریری ٹیکنالونیہ جدت آں صحت من تجارتی مقابلہ کی فروغ پریمہ۔ کامن وائس ساں لے باݜہ ویلہ ڈیٹا سیٹ اول تئیں سپُن تہ اول عوامی طورہ دستیاب کاڻ تہ ڈیٹا سیٹ درو۔ لیکن یہ کیول یہ نی ورے ایس درو۔ یہ پھٹ ورے اوپن سورس کاڻ تہ ڈیٹا سیٹ تہ حوالہ تہ مرکز تہ طورہ دڇھا۔ آں کیر عام کاڻ ترقی کُرے بہ، یہ امونہ ریلیز اپ ڈیٹ تہ پرئی ایس ایک مرکز ژوپو۔

source: Website Localization
dml: ویب سائٹ مقامی کرن

source: Websites
dml: ویب سائٹ نم

source: We couldn’t find that page for you
dml: ام میاکی سے پھٹ پیدا کُرین نی بامہ

source: We couldn’t get any audio clips for you to listen to. Please try again later.
dml: اما ملی ااُشتُرنے کی کاݨ تہ کلپ نم نی درو، مہربانی کُر یھرکی کوشیش کُرے

source: We couldn’t get any sentences for you to speak. Please try again later.
dml: ام ملی تاں مُشکُل بیاں ایک جملہ ایس نی درو۔ مہربانی کُرئی بپھرکی کوشیش کُرے

source: Weekly
dml: ہفتہ وار

source: Weekly Goal
dml: ہفتہ تہ مقصد

source: We launch the Common Voice site in this language.
dml: اماں یہ باݜا کامن وائس تہ ویب سائٹ ݜروع کُرُومہ

source: Welcome { $company } staff!
dml: ابودے آگیپی{ $company } تہ سٹاف

source: Welcome to Common Voice
dml: عام کاڻہ ابُدے آگیپی

source: Welcome to Spontaneous Speech
dml: بے ساختہ تقریر کی ابدے آگیپی

source: Welsh
dml: ویلیش

source: We may have run out of clips - refresh the page, or try again later.
dml: اما ملی کلپ خلص بیاں- پھٹ تازہ کُرے، یا بہ پھرکی کوشیش کُرے

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
dml: کیدشی تے اماکی سے درخواست پھرکی میلو نی بئتھیو, مہربانی کُری براہ راست ای میل کُرا <emailLink> { $email }</emailLink> آ ائی میا ملی دوبارہ رابط کُریمہ۔

source: We periodically release the dataset
dml: ائی ٹیم ٹیمہ ڈیٹا سیٹ جاری کُنُمہ

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
dml: یہ وعدہ کُنُمہ تے مینہ معلومات احیتاط ݜا سمبل کُریمہ۔ ورے مترا امونہ<privacyLink> رازداری تہ نوٹس</privacyLink>

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
dml: ائی ایک اوپن سورس لے باݜہ نم تہ کاڻ نم تہ ڈیٹا سیٹ ژوپائیمہ ۔ مس کُری ایس تقریری اپلیکشن تہ تربیت کی استعمل کُرین بئین

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
dml: اکبنہ تہ پرئی ایک کولو سورس ڈیٹا سیٹ عوام ساں تعاون تہ زریعہ جمع کُنُن۔ تانوں کاڻ عطیہ کُرا، ورے ماڜ ساں ریکارڈنگ تہ کلپ تہ تصدیق کُرا،ڈیٹا سیٹ سپُنہ کی ابُت ژوپایا۔

source: We’re experiencing unexpected downtime
dml: اماکی غیر متوقع ڈاون ٹیم تہ مسلہ درو

source: We're going out to get coffee.
dml: ائی کافی گیاں کی بران ینُمہ

source: We’re going out to get coffee.
dml: ائی کافی گیاں کی بران ینُمہ

source: We release the dataset every 3 months.
dml: ائی ہر ترا ماسہ ڈیٹہ سیٹ نیکھالنمہ

source: We're making some big changes
dml: ائی ایک کتی لے بلو تبدیلی نم کُنُمہ

source: We're receiving a lot of traffic and are currently investigating the issues.
dml: اماکی لے زیت ٹریفک را رون درو فی الحال مسلہ تہ چھان بین کُنُمہ

source: We’re sorry, your platform is not currently supported.
dml: ائی معافی گٹننُمہ تاں پلیٹ فام ژا نی کُرین یِنا

source: Western Penan
dml: مغربی پینان

source: Western Sierra Puebla Nahuatl
dml: مغربی سیرا پیوبلا ناہوٹل

source: Westphalian
dml: ویسٹ فیلین

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
dml: ائی ترجمہ تہ پرئی <pontoonLink> Pontoon</pontoonLink> ٹول استعمل کُنُمہ، Pontoon نہ لے باݜہ نم درو، اگر مِنہ باݜہ نی درو بہ پھرکی بی تانوں باݜہ شامل کُرئیں کی درخواست کُرا<githubRepoLink>۔ پھرکی کامن وائس تہ پراجیکٹہ تانوں گیاڅیئں کی، درخواست کُرا GitHub</githubRepoLink>۔ کی۔ <localizationFragment>ترجمہ سائہ اچھک ایس دڇھا</localizationFragment>۔

source: We’ve made some changes. Delta Segments just contain the most recent clips since the last release. <deltaLink>Read more about this work</deltaLink>.
dml: اما اچھک تبدیلی کوتُھومہ،آخری ریلیز تہ بعد ڈٰیٹا سیگمنٹہ نواں کلپ نم درو۔<deltaLink> یہ کرم تہ بارہ ورے ایس مترا</deltaLink>

source: We've run out of sentences to record in this language...
dml: یہ باݜہ اما ملی ریکارڈ کُرئیں کی جملہ نم ختم با

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
dml: ائی گٹینمہ تے مشکول تہ ماڈل ابُت بو زاننہ مختلفف باشہ پریال۔ یہ بیاں کی کاڻ تہ ڈیٹہ سیٹہ خامخا لے مختلف ماڜ تھین

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
dml: ائی یہ گٹنُمہ تے مشین لرنگ الورتھم مختلف قسم تہ پس منظر تہ شور سمبل کُرین بئین۔ آں نسبتا شورے کاڻ ایس قبول کُرم بݜ درو، شرط یہ دروئی سے میاں مکمل متن اُشتُرنن مسلہ نی کُرو۔ پس منظرہ بیݜ موسیقی سئی درو، اگر شورے موسیقی میاں ہر لفظ اُشتروننہ مسلہ کُرے بہ، سے مناسب نی درو۔

source: We welcome different accents! Be very cautious before rejecting a clip on the ground that you think the reader has mispronounced a word, has put the stress in the wrong place, or has ignored punctuation. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a generous margin of appreciation for those who may speak differently from you.
dml: ائی مختلف لہجہ ساں خیر مقدم کُنُمہ، یہ بنیادہ ایک کلپ مسترد مہ کُرا تے مترال لے ایک لفظ تہ غلط تلفظ کُتھے، دباو غلط تھانہ تھئی تھے، یا بہ اوقاف نظر انداز کُتھے۔ دنیا مختلف قسم تہ تلفظ استعمل بیاں تسومانہ بعض میاں تانوں کمیونٹی نی اُشتُرون تھیبہ۔ مہربانی کُرے تئیں ماݜہ کی زادی بلو ساتا کُرئی میاں ملی مختلف اندازہ مُشکُل بین۔

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
dml: ائی ایس <strong> امونہ کمپنی تہ منیجر آگاہ کُریمہ تے تو دلچسپی ساتنپ</strong>،تے میاکی پِرن اضافی مدد یا بہ معلومات کیرا میاکی پکار تھیو۔

source: We will be in touch with more information about how to add your language to Common Voice very soon.
dml: ائی میاں ملی رابطا تِھیمہ لے معلومتہ ملی تے کنوں کُری مینہ باݜہ کامن وائس ملی اکَٹئبہ لے پھتائی

source: We will be in touch with more information as it becomes available.
dml: ورے معلومات میلو با بہ تنئی ائی تسہ ملی رابطہ کُریمہ۔

source: We will not make your email public.
dml: ائی تاں میل عام ڜا کی نی کڅئیمہ

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
dml: ائی ڈیٹا سیٹ تہ تاں کاڻ تہ ریکارڈنگ دُرن تہ منہ درخواست ساں جائزہ گیمہ۔ اگر منہ درخواست منظور با بہ ،ائی تئں سپُں ماݜہ ملی رابطہ کُریمہ تے کی ڈیٹا سیٹ ڈوان لوڈ کُتھین آں مینہ کاڻ تہ ریکارڈنگ ایس دورئیمہ۔۔

source: We will show you a prompt or question
dml: ائی میاکی ایک اشارہ یا سول کڅیئمہ

source: We work with foundations, civil society and community partners to make the internet a healthier place, with a particular focus on East Africa. Learn more about our <programmaticWork>programmatic work.</programmaticWork>
dml: ائی خاص کر مشرقی افریقہ خصوصی توجہ ملی انٹر نیٹ صحت مند تھانہ ژوپائیں کی فاونڈیشن،سول سوسائٹی آں کمیونٹی تہ شراکت دار ملی اکٹی کرم کُنُمہ۔ امونہ <programmaticWork>تہ بارہ ورے ایس ذانا

source: What is a language on Common Voice?
dml: عام کاݩہ کیرا باݜہ درو

source: What issues are you experiencing with this content?
dml: یہ مواد ساں وجہ توکی کیہ مسیل نم درو?

source: What issues are you experiencing with this sentence?
dml: یہ جملہ تہ وجہ تو کی کیہ مسلہ نم درو

source: What is your age?
dml: تاں کیہ عمر درو?

source: What is your sex or gender?
dml: تاں جنس یا صنف کیہ درو?

source: What kind of goal do you want to build?
dml: تو کیہ قسم مقصد ژوپن گھٹِنپ

source: What needs to be in my file?
dml: ما فائلہ کیا تھین ضروری درو

source: What sentences can I add?
dml: ائی کیرا جملہ نم شامل کُرین بئیم

source: What’s inside the Common Voice dataset?
dml: کامن وائس تہ ڈیٹا سیٹ منورہ کیہ درو

source: What's Public?
dml: کیہ عوامی درو

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
dml: کیر ایک استمل کُرالے ایک کاڻ تہ کلپ نی منے بہ سے کلپ قطارہ کی ینا۔ کیر دوبارہ نی منے بہ ، سے کاڻ تہ کلپ قبرستانہ کی ݜئین اِنا

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
dml: اُشتُرنن تہ ٹیمہ لے احتیاط کُرا تے دڇھا تے کیہ ریکارڈ کُتھین سے بلکل سے درو تے کیرا لِکسن درو اگر اُچھہ غلط ایس درو بہ مسترد کُرا<br /> عام غلطی نامہ شامل درو

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
dml: کیر میاں تانوں ریکارڈنگ تہ درخس کُروبہ بہ، تہ ائی ایک یا ایک تہ زیت زپ ZIP فائل نامہ مرتب کُنُمہ۔ مینہ اولوکہ درخس نم یہ درو

source: Which variant of { $language } do you speak?
dml: کیرا لہجہ { $language } مؙشکؙل بیئپ؟

source: Why ?
dml: کُو

source: Why a profile?
dml: کو ایک پروفائل؟

source: Why are you asking?
dml: تو کو پوچاینپ

source: Why Common Voice?
dml: کُو عام کاݨ

source: Why does this matter?
dml: یہ کو ضروری درو؟

source: Why we built this Spontaneous Speech prototype
dml: اما یہ بے ساختہ اسپیچ پروٹو تائپ کو ژوپامہ

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
dml: فروفائلہ ملی، بی تانوں کرمہ نظر ساتے بیبہ آں بی تانوں کاڻ تہ کمیونٹی ملی رابطہ ساتین بیبہ

source: Wixarika
dml: وکساریکا

source: Wolof
dml: وولف

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
dml: بی تانوں کاڻ تہ ریکرڈنگ ختم کُرن تہ درخواست پرین گٹینبہ ائی?، یا بی مسو عام کاڻ تہ ٹیٹا سیٹہ تھن بہتر چمائیبہ۔

source: Write
dml: لِکن

source: Write down exactly what the person said, including placeholder words like 'um', or 'errr'.
dml: بلکل سے لِکا کیرا تنی مچے گنتھے،تھانہ استعمل بال الفاظ 'um', یا 'errr'.

source: Write down what you hear the person saying here
dml: بی تس مچ ساں کُھنڈیسن مُشکُل لِکا

source: Write options menu
dml: اختیارت تہ مینو لِکا

source: Xhosa
dml: ژوسا

source: y
dml: وائی

source: Y
dml: وائی

source: Yes
dml: آں

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
dml: سئی، موں کی ای میل ݜئی ۔ ائی اکٹہ کاݩ تہ پرجیکٹ تہ بارہ معلومت پریم

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
dml: سئی، موں کی ای میل ݜئی ۔ ائی عام کاڻہ یہ باݜہ تہ پیش رفت تہ بارہ باخبر تھین گٹنُم۔

source: Yiddish
dml: یدڈش

source: Yoruba
dml: یوروبا

source: You
dml: بی

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
dml: بی ڈاون لوڈ <size>{ $size }GB</size> شروع کُرال تھوبہ , شروع کُرا

source: You are prepared to initiate a download of <b>{ $size }</b>
dml: بی ڈاون لوڈ شروع کُرئیں کی تیار تُھوبہ ساں <b>{ $size }</b>

source: You can add sentences on the <writePageLink>Write page</writePageLink> or review sentences on the <reviewPageLink>Review page</reviewPageLink>.
dml: بی جملہ نم شامل کُرین بئیبہ<writePageLink>دڇھنی پھٹہ</writePageLink> یا بہ ریویو جملہ نم بہ<reviewPageLink> ریویو پھٹہ</reviewPageLink>

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
dml: تانوں خوخہ تہ ڈاون لوڈ منیجرہ براہ راست یو آر ایل کاپی آں پیسٹ ایس کُرین بئیبہ۔ مسونہ معیاد 12 گینٹا بیاں، لیکن بی نواں ژوپیں کی یہ پھٹہ کی واپس آڅین بئیبہ۔

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
dml: بی کی بورڈ تہ شارٹ کٹ استعمل کُرین بئیبہ{ sc-review-form-button-approve-shortcut }؛ منطوری کی،{ sc-review-form-button-reject-shortcut } مسترد کُرئیں کی،{ sc-review-form-button-skip-shortcut } وعیں کی

source: You can choose to make your username public or anonymous.
dml: تو تانو یوزر نم عوامی یا ویلائی ساتن تہ انتخاب کُرین بئیپ

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
dml: تو ین بئیپ <datasetsPage>ڈیٹا سیٹ پیج کی</datasetsPage>،تانو مرضی تہ باݜہ آں ورژن گین بئیپ، آں مس ڈاون لوڈ کُرے۔ فائلہ درو<metadataLink> متعلقہ میٹا ڈیٹا</metadataLink>، آبادیاتی معلومات آں توثیق تہ ڈیٹا۔ ڈیٹا سیٹ ڈاون لوڈ کُرئیں کی تو ایک ای میل تہ پریس۔

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
dml: بی عام کاڻ تہ پروفائل ژوپائی آں تانوں کاڻ تہ تعاون کُری متنوع ، اوپن سورس ڈیٹا سیٹ ژوپنہ مدد کُرین بئیبہ

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
dml: یہ زانے کی امونہ میل تہ لسٹہ سائن این کُرا، تے بی عام کاڻ تہ مہمات، پروگرم آں مشترکہ ڈیزئین تہ خصوصیاتہ کنو بئی حصہ گین بئیبہ

source: You cannot add multiple sentences for a single submission
dml: تو ایک جمع کُرنہ لے جملہ نم اکٹین نی بئیپ

source: You cannot request your recordings while another request is already in progress.
dml: بی تانوں ریکارڈنگ تہ ددخس نی کُرین بئبہ ایک ورے درخست پریاݜبئیں تئیں جاری درو

source: You can request a new takeout of your recordings every { $days } days.
dml: بی تانوں رکارڈنگ تہ نواں ٹیک آوٹ تہ درخستہ { $days } دیو آاݜنتہ کُرین بئبہ۔

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
dml: بی باݜہ ملی تعون کُرئیں کی پروگرم نم کُرین بئیبہ، یہ منہ خیال تہ لے اسکان درو، بی مس ویڈیو کانفرنسنگ ٹولہ ملی آں لائن کُرین بئیبہ، یا بہ زاتی طورہ اگر یہ محفوط درو بہ۔<eventTemplate> پروگرم چلئیں کی امونہ ٹیمپلیٹ آں وسائل دڇھا۔</eventTemplate>

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
dml: بی <sentenceCollectorLinkAdd> اُوچھوٹی نم جملہ ایس شامل کرین بئیبہ، </sentenceCollectorLinkAdd> آں بی<bulkImportDocsLink> Github استمل کُری بلک گٹین بئیبہ</bulkImportDocsLink>۔ یت ساتا تے جملہ نم <licenseLink> سی سی یا بہ عامل ڈومین </licenseLink>، آں بی تانو ایس لیکین بئیبہ

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
dml: بی ویکیپیڈیا تہ اُوچھوٹی جملہ تہ فائدہ گیاں کی جملہ تہ اقتباس ساں استعمل کُرین بئیبہ۔ بی استعمل کُرین بئیبہ<scraperLink>جملہ تہ ایکسائٹر</scraperLink> ویکیپیڈیا تہ مختصر جملہ نم تہ فائدہ گیا

source: You check whether the transcription matches the audio
dml: بی چیک کُرا تے تہ نقل آڈیو ملی اکبنہ درو کی نی

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
dml: بی ویب سائٹ شامل کُرین بئیبہ مثل تہ طورہ "Common Voice - https://commonvoice.mozilla.org/"

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
dml: بی تعلیمی حوالہ تہ انداز استعمل کُرین بئیبہ، مثل تہ طورہ ہاورڈ تہ انداز "Mozilla (2021) عام کاڻ۔ میلو بیاں یہ https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
dml: بی سوشل میڈیا تہ پلٹ فام استعمل کری تانو میسج ݜائن بئیہ ۔ منو پوسٹ ݜیر کُرائی تے سے وضاحت کُرو تے یہ کو اہم درو۔ باڜہ تہ حق آں مسائل تہ بارا مُشکُل بال ماڜہ ملی رابطہ کُرا، کاڻ اے ائی آں بائس ان ٹیک، سماجی مہم تہ بارا ورے ایس مشورہ دڇھا تیں موادہ ملی کیرا بی کُرین بئیبہ

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
dml: تو ایک باݜہ ایس منتخب نی کوتھوپ، مہربانی کُری تانو <profileLink> پروفائل کی یدے </profileLink>باݜہ سلیکٹ کُرے۔

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
dml: تو یہ پھٹ تہ جمع کُرن تہ حدہ کی ویبوپ۔ مہربانی کُری دوئم جملہ کُرن تہ پریبئݜیں { $retryLimit } منٹ انتطر کُرے۔ تا صبر کُرن تہ شکریہ/ مہربانی

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
dml: تو یہ پھٹ تہ جمع کُرن تہ حدہ کی ویبوپ۔ مہربانی کُری دوئم جملہ کُرن تہ پریڜبئیں { $retryLimit } سیکینڈ انتطر کُرے۔ تا صبر کُرن تہ شکریہ/ مہربانی

source: You must allow microphone access.
dml: میاں کی مائکروفونہ ویبئں کی اجازت پرین پکار درو

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
dml: توکی ریکارڈنگ تہ ہر لفظ اُشترونن تہ قابل تھین ضروری درو۔ ائی گٹینُمہ تے مشین لرننگ الگورتھم مختلف پس منظر تہ الفاظ سمبل کرین بو۔ ایا تلی تے شورے کاڻ یا خاموش پس منظر تہ میوزک ایس قبول کُرین ینا بشرط تے تئیں متن تہ مکمل حصہ نی اُئتھین۔ اگر کاڻہ کریکر یا چھنن تہ کاڻ درو بہ آن سے وجہ بی متن اُشترونین نی بیبہ تا پھرکی میاکی کلپ مسترد کُرن پکار درو۔

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
dml: بی کنو کُری الفظ تہ تلفظ کُنبہ یہ مینا لہجہ درو۔ بی کا تِھنبہ،بی ورے کیرا باݜہ پرینبہ ورے لے عوامل نم، مینہ لہجہ ݜا اثر کُنا۔بی ایا کیہ ایس معلومات شیئر کُرین بئیبہ کیرا میاکی متلقہ ژپینا بہ۔
